# GetWireItem Method (2023)

---
C#Visual BasicVisual C++
Revit 2023 API
---
FabricSheetType..::..GetWireItem Method
FabricSheetType Class See Also
---
Gets the Wire stored in the FabricSheetType at the associated index.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)**Since:** 2017
# Syntax
C#
---
```text
public FabricWireItem GetWireItem(
	int wireIndex,
	WireDistributionDirection direction
)
```

Visual Basic
---
```text
Public Function GetWireItem ( _
	wireIndex As Integer, _
	direction As WireDistributionDirection _
) As FabricWireItem
```

Visual C++
---
```text
public:
FabricWireItem^ GetWireItem(
	int wireIndex,
	WireDistributionDirection direction
)
```

# ### Parameters
wireIndex
    Type: System..::..Int32 Item index in the Fabric Sheet
direction
    Type: Autodesk.Revit.DB.Structure..::..WireDistributionDirection Wire distribution direction of the inquired item
# ### Return Value
Fabric wire Item
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | The item index is either less than 0 or greater than or equal to number of items in this FabricSheetType. |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |
| Autodesk.Revit.Exceptions..::..DisabledDisciplineException | None of the following disciplines is enabled: Structural. |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | Fabric Sheet is not Custom |

# See Also
FabricSheetType Class
Autodesk.Revit.DB.Structure Namespace